[
  {
    "title": "395th Army Band Mobile App",
    "image": "./projectImages/1.png",
    "description": "This was a dream project. I am in the 395th Army Band and serve as a senior leader and platoon sergeant. Communication is key in the unit because we only meet once a month and two weekends over the summer. I created this app to serve as a quick reference for important documents, announcements, and contact info. I also implemented a task manager for admins that allows for adding/editing/deleting tasks and assigning them to specific Soldiers, which then populates in their `My Tasks` screen. This was my first time working with React Native/Expo and it was a lot of fun and I learned a lot about the simple, yet powerful framework that is React Native.",
    "technologies": "JavaScript | React | React Native | Supabase | SQL",
    "github": "https://github.com/djordan218/395AB-React-Native",
    "deployed": "https://github.com/djordan218/395AB-React-Native",
    "bgcolor": "#5d5501",
    "id": "1"
  },
  {
    "title": "Green Thumb",
    "image": "./projectImages/gtMock.png",
    "technologies": "JavaScript | React | Node.js | PostgreSQL | Bootstrap",
    "description": "My wife and I are avid gardeners. I was looking to make an app that serves as a garden manager and this is what I came up with! I made my own API, hosted on AWS (frontend is S3, API Gateway then calls a Lambda function). Users can add/edit/delete crops from the API that only they create, except for admins - who can add/edit/delete anything. Each crop displays germination/harvest time as well as a brief description. I had a lot of fun with this project and learned a lot about React and just how powerful and responsive it can be.",
    "github": "https://github.com/djordan218/GreenThumb",
    "deployed": "http://www.greenthumb-app.xyz.s3-website-us-east-1.amazonaws.com/",
    "bgcolor": "#43d490",
    "id": "2"
  },
  {
    "title": "Movie or Snoozie",
    "image": "./projectImages/movieMock.png",
    "technologies": "JavaScript | Python | Flask",
    "description": "Movie or Snoozie is a fun web app I made that serves as a movie search. A user can save data to localStorage regarding their standards of movie ratings as well as their bedtime. When a user selects a movie, it decides if it is worth watching based on those parameters the user saved.",
    "github": "https://github.com/djordan218/movie-or-snoozie",
    "deployed": "http://ec2-35-175-104-106.compute-1.amazonaws.com:8000//",
    "bgcolor": "red",
    "id": "3"
  },
  {
    "title": "Hack or Snooze (HackerNews Clone)",
    "image": "./projectImages/hackOrSnoozeMock.png",
    "technologies": "JavaScript | Node.js",
    "description": "A quiz app on the fundamentals of JavaScript. There are 5 randomly selected multiple-choice questions and the user will have a time limit of 50 seconds. The remaining time will determine their score at the end. The user will be penalised by 10 seconds for every incorrect answer.",
    "github": "https://github.com/djordan218/Hack-or-Snooze",
    "deployed": "https://djordan218.github.io/Hack-or-Snooze/",
    "bgcolor": "#fb6304",
    "id": "4"
  },
  {
    "title": "Jeopardy",
    "image": "./projectImages/jeopardyMock.png",
    "technologies": "HTML | CSS | JavaScript",
    "description": "A JavaScript based web app that uses game logic, utilizes an API, and some good ole-fashioned DOM manipulation. Had a lot of fun with this one, but I did learn about the imperfections of APIs and how to manipulate API responses with a little conditioning.",
    "github": "https://github.com/djordan218/Jeopardy",
    "deployed": "https://djordan218.github.io/Jeopardy/",
    "bgcolor": "#060e7d",
    "id": "5"
  },
  {
    "title": "Connect Four",
    "image": "./projectImages/connect4Mock.png",
    "technologies": "HTML | CSS | JavaScript",
    "description": "This was a fun game-logic project when learning the in's and out's of JavaScript. I learned about DOM manipulation, game logic, and working with APIs.",
    "github": "https://github.com/djordan218/Connect-Four-JavaScript",
    "deployed": "https://djordan218.github.io/Connect-Four-JavaScript/",
    "bgcolor": "#844929",
    "id": "6"
  }
]
